# Sample to connect with SQL Server from Jupyter & Python

Check Noted.MD to revieww the connection details to enable SQL SERVER ODBC

@autor Israel Sanchez

In [1]:
import pyodbc 
import pandas as pd

In [2]:
pyodbc.drivers()

['ODBC Driver 18 for SQL Server']

# parece el bueno

In [3]:
# Some other example server values are
# server = 'localhost\sqlexpress' # for a named instance
# server = 'myserver,port' # to specify an alternate port
server = 'tcp:192.168.100.45' 
database = 'AdventureWorksDW2022' 
#database = 'Master' 
username = 'sa' 
password = 'M1dNigt3ss' 
# ENCRYPT defaults to yes starting in ODBC Driver 18. It's good to always specify ENCRYPT=yes on the client side to avoid MITM attacks.
cnxn = pyodbc.connect('DRIVER={ODBC Driver 18 for SQL Server};sslverify=0;SERVER='+server+
                      ';DATABASE=' + database+
                      ';UID='+username+
                      ';PWD='+ password +
                      ';trusted_connection=no;Encrypt=no;')
cursor = cnxn.cursor()

In [6]:

sql = "SELECT *  from [AdventureWorksDW2022].[dbo].[FactFinance]"
data = pd.read_sql(sql, cnxn)  # without parameters [non-prepared statement]
data.count()

/tmp/ipykernel_16034/1910690309.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  data = pd.read_sql(sql, cnxn)  # without parameters [non-prepared statement]

FinanceKey            39409
DateKey               39409
OrganizationKey       39409
DepartmentGroupKey    39409
ScenarioKey           39409
AccountKey            39409
Amount                39409
Date                  39409
dtype: int64

In [5]:
import pandas as pd
import numpy as np
import time
from sqlalchemy import create_engine, event
from urllib.parse import quote_plus

In [6]:

# for pyodbc
#engine = create_engine('mssql+pyodbc://TestUser:TestUserPAss@DESKTOP-QLSOTTG\\SQLEXPRESS:1433/TestDB?driver=ODBC+Driver+17+for+SQL+Server', fast_executemany=True)
engine = create_engine("mssql+pyodbc://sa:M1dNigt3ss@192.168.100.45:1433/AdventureWorksDW2022?driver=ODBC+Driver+18+for+SQL+Server&trusted_connection=no&encrypt=no", fast_executemany=True)

In [7]:
# test data
num_rows = 10000
num_cols = 100
df = pd.DataFrame(
    [[f'row{x:04}col{y:03}' for y in range(num_cols)] for x in range(num_rows)],
    columns=[f'col{y:03}' for y in range(num_cols)]
)

t0 = time.time()
df.to_sql("sqlalchemy_test", engine, if_exists='replace', index=None)
print(f"pandas wrote {num_rows} rows in {(time.time() - t0):0.1f} seconds")

pandas wrote 10000 rows in 1.4 seconds

In [9]:
%time
sql = "SELECT TOP 10 * FROM [AdventureWorksDW2022].[dbo].[FactFinance]"
data = pd.read_sql(sql, engine)  # without parameters [non-prepared statement]
data

CPU times: user 1e+03 ns, sys: 1e+03 ns, total: 2 µs
Wall time: 2.62 µs

,FinanceKey,DateKey,OrganizationKey,DepartmentGroupKey,ScenarioKey,AccountKey,Amount,Date
0,1,20101229,3,1,1,60,22080.0,2010-12-29
1,2,20101229,3,1,2,60,20200.0,2010-12-29
2,3,20101229,3,1,2,61,2000.0,2010-12-29
3,4,20101229,3,1,1,61,2208.0,2010-12-29
4,5,20101229,3,1,1,62,1546.0,2010-12-29
5,6,20101229,3,1,2,62,1800.0,2010-12-29
6,7,20101229,3,1,2,65,380.0,2010-12-29
7,8,20101229,3,1,1,65,378.0,2010-12-29
8,9,20101229,3,1,1,66,344.0,2010-12-29
9,10,20101229,3,1,2,66,380.0,2010-12-29